Revit 2027 API
StairsType.MinRunWidth Property
 The initial value for the width of a common run.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double MinRunWidth { get; set; }
Public Property MinRunWidth As Double
	Get
	Set
public:
property double MinRunWidth {
	double get ();
	void set (double value);
}
member MinRunWidth : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for minRunWidth must be greater than 0 and no more than 30000 feet.
See Also
Reference
StairsType Class
Autodesk.Revit.DB.Architecture Namespace